; domain
(define (domain emergencia)
  (:requirements :strips :typing)

  (:types
    location
    person
    crate
    content
    drone
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (has-content ?c - crate ?con - content)
    (has ?p - person ?con - content)

    (free-arm1 ?d - drone)
    (free-arm2 ?d - drone)

    (carrying-arm1 ?d - drone ?c - crate)
    (carrying-arm2 ?d - drone ?c - crate)

    (available ?c - crate)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition
      (at-drone ?d ?from)
    :effect
      (and
        (not (at-drone ?d ?from))
        (at-drone ?d ?to)
      )
  )

  (:action pickup-arm1
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm1 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm1 ?d))
        (not (available ?c))
        (carrying-arm1 ?d ?c)
      )
  )

  (:action pickup-arm2
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm2 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm2 ?d))
        (not (available ?c))
        (carrying-arm2 ?d ?c)
      )
  )

  (:action deliver-arm1
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm1 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm1 ?d ?c))
        (free-arm1 ?d)
        (has ?p ?con)
      )
  )

  (:action deliver-arm2
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm2 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm2 ?d ?c))
        (free-arm2 ?d)
        (has ?p ?con)
      )
  )
)

; problem
(define (problem drone_problem_d1_r0_l25_p25_c25_g25_ct2)
(:domain emergencia)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
)
(:init
	(at-drone drone1 depot)
	(free-arm1 drone1)
	(free-arm2 drone1)
	(at-crate crate1 depot)
	(available crate1)
	(at-crate crate2 depot)
	(available crate2)
	(at-crate crate3 depot)
	(available crate3)
	(at-crate crate4 depot)
	(available crate4)
	(at-crate crate5 depot)
	(available crate5)
	(at-crate crate6 depot)
	(available crate6)
	(at-crate crate7 depot)
	(available crate7)
	(at-crate crate8 depot)
	(available crate8)
	(at-crate crate9 depot)
	(available crate9)
	(at-crate crate10 depot)
	(available crate10)
	(at-crate crate11 depot)
	(available crate11)
	(at-crate crate12 depot)
	(available crate12)
	(at-crate crate13 depot)
	(available crate13)
	(at-crate crate14 depot)
	(available crate14)
	(at-crate crate15 depot)
	(available crate15)
	(at-crate crate16 depot)
	(available crate16)
	(at-crate crate17 depot)
	(available crate17)
	(at-crate crate18 depot)
	(available crate18)
	(at-crate crate19 depot)
	(available crate19)
	(at-crate crate20 depot)
	(available crate20)
	(at-crate crate21 depot)
	(available crate21)
	(at-crate crate22 depot)
	(available crate22)
	(at-crate crate23 depot)
	(available crate23)
	(at-crate crate24 depot)
	(available crate24)
	(at-crate crate25 depot)
	(available crate25)
	(has-content crate1 food)
	(has-content crate2 food)
	(has-content crate3 food)
	(has-content crate4 food)
	(has-content crate5 food)
	(has-content crate6 food)
	(has-content crate7 food)
	(has-content crate8 food)
	(has-content crate9 food)
	(has-content crate10 food)
	(has-content crate11 food)
	(has-content crate12 food)
	(has-content crate13 food)
	(has-content crate14 medicine)
	(has-content crate15 medicine)
	(has-content crate16 medicine)
	(has-content crate17 medicine)
	(has-content crate18 medicine)
	(has-content crate19 medicine)
	(has-content crate20 medicine)
	(has-content crate21 medicine)
	(has-content crate22 medicine)
	(has-content crate23 medicine)
	(has-content crate24 medicine)
	(has-content crate25 medicine)
	(at-person person1 loc12)
	(at-person person2 loc6)
	(at-person person3 loc11)
	(at-person person4 loc14)
	(at-person person5 loc2)
	(at-person person6 loc4)
	(at-person person7 loc5)
	(at-person person8 loc23)
	(at-person person9 loc8)
	(at-person person10 loc2)
	(at-person person11 loc19)
	(at-person person12 loc21)
	(at-person person13 loc18)
	(at-person person14 loc20)
	(at-person person15 loc22)
	(at-person person16 loc3)
	(at-person person17 loc1)
	(at-person person18 loc4)
	(at-person person19 loc21)
	(at-person person20 loc7)
	(at-person person21 loc20)
	(at-person person22 loc19)
	(at-person person23 loc4)
	(at-person person24 loc13)
	(at-person person25 loc3)
)
(:goal (and
	(at-drone drone1 depot)
	(has person2 medicine)
	(has person3 food)
	(has person3 medicine)
	(has person4 food)
	(has person4 medicine)
	(has person5 food)
	(has person7 food)
	(has person7 medicine)
	(has person8 food)
	(has person10 food)
	(has person11 food)
	(has person11 medicine)
	(has person15 food)
	(has person15 medicine)
	(has person16 food)
	(has person17 food)
	(has person18 food)
	(has person18 medicine)
	(has person19 medicine)
	(has person20 food)
	(has person20 medicine)
	(has person22 medicine)
	(has person23 food)
	(has person23 medicine)
	(has person24 medicine)
	))
)

; plan
1. (pickup-arm2 drone1 crate25 depot)
   deleted: (at-crate crate25 depot) (free-arm2 drone1) (available crate25)
   added: (carrying-arm2 drone1 crate25)
   goals met: 1 of 26
2. (pickup-arm1 drone1 crate13 depot)
   deleted: (at-crate crate13 depot) (free-arm1 drone1) (available crate13)
   added: (carrying-arm1 drone1 crate13)
   goals met: 1 of 26
3. (fly drone1 depot loc23)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc23)
   goals met: 0 of 26
4. (deliver-arm1 drone1 crate13 person8 food loc23)
   deleted: (carrying-arm1 drone1 crate13)
   added: (free-arm1 drone1) (has person8 food)
   goals met: 1 of 26
5. (fly drone1 loc23 depot)
   deleted: (at-drone drone1 loc23)
   added: (at-drone drone1 depot)
   goals met: 2 of 26
6. (pickup-arm1 drone1 crate12 depot)
   deleted: (at-crate crate12 depot) (free-arm1 drone1) (available crate12)
   added: (carrying-arm1 drone1 crate12)
   goals met: 2 of 26
7. (fly drone1 depot loc21)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc21)
   goals met: 1 of 26
8. (deliver-arm2 drone1 crate25 person19 medicine loc21)
   deleted: (carrying-arm2 drone1 crate25)
   added: (free-arm2 drone1) (has person19 medicine)
   goals met: 2 of 26
9. (fly drone1 loc21 depot)
   deleted: (at-drone drone1 loc21)
   added: (at-drone drone1 depot)
   goals met: 3 of 26
10. (pickup-arm2 drone1 crate24 depot)
   deleted: (at-crate crate24 depot) (free-arm2 drone1) (available crate24)
   added: (carrying-arm2 drone1 crate24)
   goals met: 3 of 26
11. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 2 of 26
12. (deliver-arm2 drone1 crate24 person24 medicine loc13)
   deleted: (carrying-arm2 drone1 crate24)
   added: (free-arm2 drone1) (has person24 medicine)
   goals met: 3 of 26
13. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 4 of 26
14. (pickup-arm2 drone1 crate23 depot)
   deleted: (at-crate crate23 depot) (free-arm2 drone1) (available crate23)
   added: (carrying-arm2 drone1 crate23)
   goals met: 4 of 26
15. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 3 of 26
16. (deliver-arm2 drone1 crate23 person2 medicine loc6)
   deleted: (carrying-arm2 drone1 crate23)
   added: (free-arm2 drone1) (has person2 medicine)
   goals met: 4 of 26
17. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 5 of 26
18. (pickup-arm2 drone1 crate22 depot)
   deleted: (at-crate crate22 depot) (free-arm2 drone1) (available crate22)
   added: (carrying-arm2 drone1 crate22)
   goals met: 5 of 26
19. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 4 of 26
20. (deliver-arm1 drone1 crate12 person16 food loc3)
   deleted: (carrying-arm1 drone1 crate12)
   added: (free-arm1 drone1) (has person16 food)
   goals met: 5 of 26
21. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 6 of 26
22. (pickup-arm1 drone1 crate11 depot)
   deleted: (at-crate crate11 depot) (free-arm1 drone1) (available crate11)
   added: (carrying-arm1 drone1 crate11)
   goals met: 6 of 26
23. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 5 of 26
24. (deliver-arm1 drone1 crate11 person17 food loc1)
   deleted: (carrying-arm1 drone1 crate11)
   added: (free-arm1 drone1) (has person17 food)
   goals met: 6 of 26
25. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 7 of 26
26. (pickup-arm1 drone1 crate10 depot)
   deleted: (at-crate crate10 depot) (free-arm1 drone1) (available crate10)
   added: (carrying-arm1 drone1 crate10)
   goals met: 7 of 26
27. (fly drone1 depot loc22)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc22)
   goals met: 6 of 26
28. (deliver-arm2 drone1 crate22 person15 medicine loc22)
   deleted: (carrying-arm2 drone1 crate22)
   added: (free-arm2 drone1) (has person15 medicine)
   goals met: 7 of 26
29. (deliver-arm1 drone1 crate10 person15 food loc22)
   deleted: (carrying-arm1 drone1 crate10)
   added: (free-arm1 drone1) (has person15 food)
   goals met: 8 of 26
30. (fly drone1 loc22 depot)
   deleted: (at-drone drone1 loc22)
   added: (at-drone drone1 depot)
   goals met: 9 of 26
31. (pickup-arm2 drone1 crate21 depot)
   deleted: (at-crate crate21 depot) (free-arm2 drone1) (available crate21)
   added: (carrying-arm2 drone1 crate21)
   goals met: 9 of 26
32. (pickup-arm1 drone1 crate9 depot)
   deleted: (at-crate crate9 depot) (free-arm1 drone1) (available crate9)
   added: (carrying-arm1 drone1 crate9)
   goals met: 9 of 26
33. (fly drone1 depot loc19)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc19)
   goals met: 8 of 26
34. (deliver-arm2 drone1 crate21 person11 medicine loc19)
   deleted: (carrying-arm2 drone1 crate21)
   added: (free-arm2 drone1) (has person11 medicine)
   goals met: 9 of 26
35. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 10 of 26
36. (pickup-arm2 drone1 crate20 depot)
   deleted: (at-crate crate20 depot) (free-arm2 drone1) (available crate20)
   added: (carrying-arm2 drone1 crate20)
   goals met: 10 of 26
37. (fly drone1 depot loc19)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc19)
   goals met: 9 of 26
38. (deliver-arm2 drone1 crate20 person22 medicine loc19)
   deleted: (carrying-arm2 drone1 crate20)
   added: (free-arm2 drone1) (has person22 medicine)
   goals met: 10 of 26
39. (deliver-arm1 drone1 crate9 person11 food loc19)
   deleted: (carrying-arm1 drone1 crate9)
   added: (free-arm1 drone1) (has person11 food)
   goals met: 11 of 26
40. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 12 of 26
41. (pickup-arm2 drone1 crate19 depot)
   deleted: (at-crate crate19 depot) (free-arm2 drone1) (available crate19)
   added: (carrying-arm2 drone1 crate19)
   goals met: 12 of 26
42. (pickup-arm1 drone1 crate8 depot)
   deleted: (at-crate crate8 depot) (free-arm1 drone1) (available crate8)
   added: (carrying-arm1 drone1 crate8)
   goals met: 12 of 26
43. (fly drone1 depot loc14)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc14)
   goals met: 11 of 26
44. (deliver-arm2 drone1 crate19 person4 medicine loc14)
   deleted: (carrying-arm2 drone1 crate19)
   added: (free-arm2 drone1) (has person4 medicine)
   goals met: 12 of 26
45. (deliver-arm1 drone1 crate8 person4 food loc14)
   deleted: (carrying-arm1 drone1 crate8)
   added: (free-arm1 drone1) (has person4 food)
   goals met: 13 of 26
46. (fly drone1 loc14 depot)
   deleted: (at-drone drone1 loc14)
   added: (at-drone drone1 depot)
   goals met: 14 of 26
47. (pickup-arm2 drone1 crate18 depot)
   deleted: (at-crate crate18 depot) (free-arm2 drone1) (available crate18)
   added: (carrying-arm2 drone1 crate18)
   goals met: 14 of 26
48. (pickup-arm1 drone1 crate7 depot)
   deleted: (at-crate crate7 depot) (free-arm1 drone1) (available crate7)
   added: (carrying-arm1 drone1 crate7)
   goals met: 14 of 26
49. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 13 of 26
50. (deliver-arm2 drone1 crate18 person3 medicine loc11)
   deleted: (carrying-arm2 drone1 crate18)
   added: (free-arm2 drone1) (has person3 medicine)
   goals met: 14 of 26
51. (deliver-arm1 drone1 crate7 person3 food loc11)
   deleted: (carrying-arm1 drone1 crate7)
   added: (free-arm1 drone1) (has person3 food)
   goals met: 15 of 26
52. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 16 of 26
53. (pickup-arm2 drone1 crate17 depot)
   deleted: (at-crate crate17 depot) (free-arm2 drone1) (available crate17)
   added: (carrying-arm2 drone1 crate17)
   goals met: 16 of 26
54. (pickup-arm1 drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (free-arm1 drone1) (available crate6)
   added: (carrying-arm1 drone1 crate6)
   goals met: 16 of 26
55. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 15 of 26
56. (deliver-arm2 drone1 crate17 person20 medicine loc7)
   deleted: (carrying-arm2 drone1 crate17)
   added: (free-arm2 drone1) (has person20 medicine)
   goals met: 16 of 26
57. (deliver-arm1 drone1 crate6 person20 food loc7)
   deleted: (carrying-arm1 drone1 crate6)
   added: (free-arm1 drone1) (has person20 food)
   goals met: 17 of 26
58. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 18 of 26
59. (pickup-arm2 drone1 crate16 depot)
   deleted: (at-crate crate16 depot) (free-arm2 drone1) (available crate16)
   added: (carrying-arm2 drone1 crate16)
   goals met: 18 of 26
60. (pickup-arm1 drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (free-arm1 drone1) (available crate5)
   added: (carrying-arm1 drone1 crate5)
   goals met: 18 of 26
61. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 17 of 26
62. (deliver-arm2 drone1 crate16 person7 medicine loc5)
   deleted: (carrying-arm2 drone1 crate16)
   added: (free-arm2 drone1) (has person7 medicine)
   goals met: 18 of 26
63. (deliver-arm1 drone1 crate5 person7 food loc5)
   deleted: (carrying-arm1 drone1 crate5)
   added: (free-arm1 drone1) (has person7 food)
   goals met: 19 of 26
64. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 20 of 26
65. (pickup-arm2 drone1 crate15 depot)
   deleted: (at-crate crate15 depot) (free-arm2 drone1) (available crate15)
   added: (carrying-arm2 drone1 crate15)
   goals met: 20 of 26
66. (pickup-arm1 drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (free-arm1 drone1) (available crate4)
   added: (carrying-arm1 drone1 crate4)
   goals met: 20 of 26
67. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 19 of 26
68. (deliver-arm2 drone1 crate15 person18 medicine loc4)
   deleted: (carrying-arm2 drone1 crate15)
   added: (free-arm2 drone1) (has person18 medicine)
   goals met: 20 of 26
69. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 21 of 26
70. (pickup-arm2 drone1 crate14 depot)
   deleted: (at-crate crate14 depot) (free-arm2 drone1) (available crate14)
   added: (carrying-arm2 drone1 crate14)
   goals met: 21 of 26
71. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 20 of 26
72. (deliver-arm2 drone1 crate14 person23 medicine loc4)
   deleted: (carrying-arm2 drone1 crate14)
   added: (free-arm2 drone1) (has person23 medicine)
   goals met: 21 of 26
73. (deliver-arm1 drone1 crate4 person18 food loc4)
   deleted: (carrying-arm1 drone1 crate4)
   added: (free-arm1 drone1) (has person18 food)
   goals met: 22 of 26
74. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 23 of 26
75. (pickup-arm2 drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (free-arm2 drone1) (available crate3)
   added: (carrying-arm2 drone1 crate3)
   goals met: 23 of 26
76. (pickup-arm1 drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (free-arm1 drone1) (available crate2)
   added: (carrying-arm1 drone1 crate2)
   goals met: 23 of 26
77. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 22 of 26
78. (deliver-arm2 drone1 crate3 person23 food loc4)
   deleted: (carrying-arm2 drone1 crate3)
   added: (free-arm2 drone1) (has person23 food)
   goals met: 23 of 26
79. (fly drone1 loc4 loc2)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc2)
   goals met: 23 of 26
80. (deliver-arm1 drone1 crate2 person5 food loc2)
   deleted: (carrying-arm1 drone1 crate2)
   added: (free-arm1 drone1) (has person5 food)
   goals met: 24 of 26
81. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 25 of 26
82. (pickup-arm2 drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (free-arm2 drone1) (available crate1)
   added: (carrying-arm2 drone1 crate1)
   goals met: 25 of 26
83. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 24 of 26
84. (deliver-arm2 drone1 crate1 person10 food loc2)
   deleted: (carrying-arm2 drone1 crate1)
   added: (free-arm2 drone1) (has person10 food)
   goals met: 25 of 26
85. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 26 of 26
